{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
  },
  "text": {
    "more": "This graph uses network mapping to visually represent the topical relatedness of the rare books at the Dominican Theological Library. Each point in the network represents a single book, and each line connecting two points represents a subject heading shared by both books. Tightly clustered groups of points result when many books share all or most of their subject headings. Clusters that are far apart share no (or almost no) common subject headings. By visualizing the collections in this way, we can gain some insights into the interconnectedness of the various topics within the Rare Books Room.",
    "intro": "A visual representation of the Rare Books and Special Collections held by the Dominican Theological Library",
    "title": "DTL_RareBooksNetwork"
  },
  "legend": {
    "edgeLabel": "Each line connecting two points represents a shared subject heading.",
    "colorLabel": "Colored lines represent the most popular subject headings in the collection as a whole.",
	  "legend":{
	  	"file":".../images/legend.png"
	  },
    "nodeLabel": "Each point in the network is one book from the Rare Books Room. Their color corresponds to the collection they come from (green for Rare Books, blue for Special Collections, orange for Canon Law, and red for Incunabula). Their size indicate how many shared subject headings they have."
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": false,
    "hoverBehavior": "dim"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "straight",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 3
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}